test/dummy/app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT "materials".* FROM "materials"

  def create
    @material = Material.new(params[:material])
    @material.save
---
INSERT INTO "materials" ("name", "created_user", "updated_user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lumber"], ["created_user", 1], ["updated_user", 1], ["created_at", "2015-04-27 15:44:09.228528"], ["updated_at", "2015-04-27 15:44:09.228528"]]

  def update
    @material.update_attributes(params[:material])
---
UPDATE "materials" SET "updated_user" = 2, "updated_at" = '2015-04-27 16:58:29.529971' WHERE "materials"."id" = 1

  def destroy
    @material.destroy
---
DELETE FROM "materials" WHERE "materials"."id" = ?  [["id", 1]]

    def set_material
      @material = Material.find(params[:id])
---
SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT 1  [["id", 1]]