test/dummy/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "created_user", "created_at", "updated_at", "updated_user") VALUES (?, ?, ?, ?, ?)  [["name", "Apple"], ["created_user", "admin"], ["created_at", "2015-04-27 15:48:29.733156"], ["updated_at", "2015-04-27 15:48:29.733156"], ["updated_user", "admin"]]
---
  def create
    @product = Product.new(params[:product])
    @product.save

UPDATE "products" SET "updated_user" = 'user', "updated_at" = '2015-04-27 16:58:29.704280' WHERE "products"."id" = 1
---
  def update
    @product.update_attributes(params[:product])

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_product
      @product = Product.find(params[:id])